{
  "nav": {
    "form": "แบบประเมิน",
    "result": "ผลการประเมิน",
    "greeting": "สวัสดี, {{name}}",
    "defaultUser": "ผู้ใช้",
    "logout": "Log out",
    "loggingOut": "Logging out..."
  },
  "form": {
    "loading": "กำลังโหลด...",
    "back": "ย้อนกลับ",
    "next": "ถัดไป",
    "submit": "ส่งคำตอบ",
    "submitSuccess": "บันทึกคำตอบเรียบร้อยแล้ว",
    "submitError": "เกิดข้อผิดพลาดในการส่งคำตอบ"
  },
  "result": {
    "title": "ระดับสมรรถนะการเรียนการสอนตามกรอบแนวคิด KMUTT PSF",
    "statusTitle": "สถานะผลการประเมิน:",
    "statusGreen": "หมายถึง พฤติกรรมการสอนของท่านสอดคล้องกับคุณลักษณะที่คาดหวังในสมรรถนะระดับ Competent/Proficient",
    "statusYellow": "หมายถึง พฤติกรรมการสอนของท่านสอดคล้องกับคุณลักษณะที่คาดหวังเพียงบางส่วน",
    "statusGray": "หมายถึง พฤติกรรมการสอนของท่านยังไม่สอดคล้องกับคุณลักษณะที่คาดหวัง",
    "downloadReport": "Download report",
    "downloadSummary": "Download summary report",
    "pollTitle": "หลังจากได้ทำแบบประเมินเรียบร้อยแล้ว เราอยากทราบความคิดเห็นของท่าน",
    "pollSubmit": "Submit",
    "noData": "ไม่พบข้อมูลผลการประเมิน",
    "saveSuccess": "บันทึกข้อมูลสำเร็จ",
    "saveError": "เกิดข้อผิดพลาด",
    "downloadError": "ไม่สามารถดาวน์โหลดรายงานได้ในขณะนี้",
    "permissionError": "You don't have permission to access this file"
  },
  "home": {
    "title": "แบบสำรวจเพื่อการพัฒนาตนเองตามกรอบ KMUTT PSF (Teaching and Supporting Learning)",
    "loginBtn": "Login with KMUTT Account",
    "section1Title": "แบบสำรวจนี้พัฒนาขึ้นเพื่ออะไร?",
    "section1Body": "แบบสำรวจเพื่อการพัฒนาตนเองชุดนี้จัดทำขึ้นเพื่อให้ท่านได้ลองประเมินตนเองว่าใน KMUTT Professional Standards Framework for teaching and supporting learning (KMUTT PSF) ระดับ Competent และ Proficient ท่านมีสมรรถนะใดแล้วบ้าง และเสนอแนะในส่วนที่ท่านอาจเพิ่มเติม และแนะนำกิจกรรมหรือแหล่งเรียนรู้ที่จะช่วยพัฒนาการจัดการเรียนรู้ของท่าน และท่านอาจใช้ข้อมูลเหล่านี้ประกอบในการตัดสินใจขอรับรอง KMUTT PSF ด้านการจัดการเรียนการสอน",
    "section2Title": "แบบสำรวจนี้นำไปใช้อย่างไร?",
    "section2Body": "แบบสำรวจนี้เราได้นำแต่ละองค์ประกอบที่ระบุใน KMUTT PSF (Teaching and Support Learning) ระดับ Competent และ Proficient มา regroup มาถอดเป็นคำถามเพียง 8 ข้อ เป็นคำถามแบบ checklist ที่ให้ท่านเลือกตอบข้อที่ตรงกับการจัดการเรียนการสอนของท่านใช้เวลาตอบประมาณ 3-5 นาที คำตอบจะถูกนำไปแปรผลโดย map กลับไปที่สมรรถนะที่ระบุไว้ของแต่ละระดับ ผลที่ออกมานั้นเป็นเพียงการคาดคะเนสมรรถนะจากคำตอบที่มาจากประสบการณ์ของท่านเท่านั้น คำตอบจึงใช้เป็นเพียงแนวทางในการพิจารณาเบื้องต้นมิได้นำไปสู่การสรุปผลว่าท่านผ่านหรือไม่ผ่านสมรรถนะในระดับใด",
    "section3Title": "ข้อมูลจากคำตอบของท่านจะนำไปทำอะไร",
    "section3Body": "ข้อมูลของท่านจะถูกเก็บไว้เพื่อให้ท่านสามารถเรียกดูผลของแบบสำรวจที่ท่านทำไปแล้ว และในขณะเดียวกันเราจะนำข้อมูลไปออกแบบการพัฒนาการจัดการเรียนรู้เพื่อให้ตรงกับความต้องการของประชาคม มจธ. ผู้ที่จะสามารถเข้าถึงข้อมูลรายบุคคลได้ จะเป็นผู้ที่เกี่ยวข้องกับการพัฒนาอาจารย์เท่านั้น ข้อมูลที่นำเสนอต่อผู้บริหารมหาวิทยาลัย จะเป็นข้อมูลภาพรวมของหน่วยงานและของมหาวิทยาลัยเท่านั้น"
  }
}
